{"pages":[],"posts":[{"title":"hello-world","text":"","link":"/2020/02/26/hello-world-1/"},{"title":"ubuntu","text":"windows10+Ubuntu双系统安装 &emsp;&emsp;由于图像课程，所以需要安装Ubuntu系统。为什么不用虚拟机，是因为考虑到虚拟机运行效率太 低，毕竟是一个硬件（笔记本）同时运行两个系统。而双系统整体上运行效率会更高，因此最后选择了装Ubuntu双系统。于是我查阅了相关的教程，尤其是csdn，但是不得不说，目前的一些教程对于现在UEFI Bios启动模式的电脑来说，是很不适用的。当然如果你的Bios启动模式是legacy的，那么可以去百度一些其他的安装方式，应该都是可以的。在这篇教程中，我主要是介绍UEFI的一个安装方式。 问题1&emsp;&emsp;有些同学会问，什么是UEFI和legacy启动方式，那么在这里就告诉大家应该怎么查看自己电脑的启动方式。键盘win+r进入命令控制台，然后输入msinfo32，在右侧找到【BIOS模式】，如果显示的是UEFI，那么就是UEFI的启动模式啦。如果你是UEFI启动模式那么你就可以接着往下看了。 第一步：下载系统镜像&emsp;&emsp;首先要下载Ubuntu系统的镜像文件，在这里需要注意不要在Ubuntu官网上下载，因为Ubuntu官网的站点应该是在国外，国内下载会很慢，笔者试过搭梯子下载，依然速度感人。所以在这里我给大家推荐网易的镜像下载 。注意的是我这里选择的是release版本，也就是相对稳定的版本，我也推荐大家用这个版本，具体选择18.04.4版本下载就可以了。 第二步：硬盘分区&emsp;&emsp;win+x然后选择磁盘管理，然后大家自己分区就可以，具体操作很简单，网上都有。但是这里要注意几个分区的问题。 &emsp;&emsp;首先我默认大家都有两个硬盘以上，如果大家只有一个系统硬盘，那我不建议装双系统，有时候windows和Ubuntu系统在同一盘会出现问题。 &emsp;&emsp;那么对于多个系统盘来说，首先我们在系统盘（一般是c盘）分区200m的空白分区用来安装Ubuntu的启动项。当然你也可以直接装在window启动项里，百度也有人会推荐这样装，但是我发现并不是每个人的windows启动项预留空间都是足够的，所以为了避免麻烦，这个分区我认为是有必要的。 &emsp;&emsp;接下来从你的非系统盘中划分空间，在这里有些教程只划分40g，我不建议，40G对于长期使用Ubuntu是不够的，我个人认为150G是一个合适的空间，当然大家可以根据实际情况进行选择。 &emsp;&emsp;最后需要注意的是，硬盘压缩出空间后不要分配卷，正常情况分出空闲区应该是显示的一个黑色边框的分区。 第三步：制作启动u盘&emsp;&emsp;在这里我推荐大家使用rufus这个软件来制作启动盘，笔者试过多次，是比较稳定的u盘制作工具。下载完成后按win+x然后选择磁盘管理，会进入下图的界面，我这里是有两个盘，你们可以按自己的情况分别看一下自己。 &emsp;&emsp;然后分别在上图红色方框中右键——属性——卷。在这个页面我们可以看到硬盘分区形式，我自己的是GPT格式，你们可能会有MBR格式的。 &emsp;&emsp;接着进入下载好的rufus工具，选择你的下好的镜像文件，插入提前准备好的u盘，u盘数据重要记得备份，因为u盘的数据会因为安装系统文件而清空。然后选择好分区类型，也就是刚才查看到的GPT格式或者是MBR格式。然后就可以开始制作了。 ​ &emsp;&emsp;这里需要注意的是U盘要选用质量好一些的，否则会出现在安装系统过程中，硬盘内容无法复制的错误，系统一般会提醒是硬盘本身可能坏了，但是其实大部分情况并不是电脑硬盘坏了，而是u盘的问题，我自己就是换了一个u盘就成功了。 第四步：安装系统&emsp;&emsp;插上刚才制作好的u盘，重启电脑，开机进入bios, 我的电脑是戴尔，是按F2进入，不同电脑型号可能有所不同，大家自行百度即可。在security页面关掉secure boot，也就是让它Disabled。然后保存更改，戴尔是按f10，之后按f12进入启动页面，选择刚刚做好的u盘启动。应该是在UEFI OPTIONS这个大分类下的。如果无法启动，电脑会重启，再自己根据电脑按相应的键进入boot manager，找到USB启动项，回车进入。 &emsp;&emsp;那么正常情况大家就已经进入到安装系统界面了，选择Install Ubuntu进入就可以了，然后就是选择语言，往下拉有中文选项，然后是选择键盘布局，英语（美国）默认布局就可以了。但是在这里有些朋友可能会出现安装卡死不动的情况，这是因为N卡和Ubuntu系统兼容的问题。如果出现了，就需要退出安装，拔出U盘，再重新插入，进入到系统安装选择界面时，也就是有try Ubuntu without installing 和install Ubuntu这些选项的界面时，按E键，会出现一个黑框，在倒数第二行左右，找到 quiet splash - - - 改为quiet splash acpi=off &emsp;&emsp;再按f10保存，然后会进入安装界面，在桌面上有一个install ubuntu安装即可。然后在和刚才一样，选择语言键盘布局，之后可能会询问是否连接wifi，我建议是不要链接，因为ubuntu本身的源是在国外，一边安装一边下载会等很久的时间。 &emsp;&emsp;进入下一个界面选择正常安装，同时勾选为图形或无线硬件，以及….这个选项，然后继续。 &emsp;&emsp;然后将会看到类似这样一个界面，在这里大家一定要点击其他选项，有些博客会告诉你可以默认安装，我强烈不建议这样做，这样会让你的系统文件发生一些未知的错误。 &emsp;&emsp;大家将会进入到分区的界面，可以找到两个空闲分区，一个是我们分好的200m空间，另一个是150g的空间。首先找到事先分好的200m空闲分区，点左下角的加号，选择逻辑分区，空间起始位置，用于efi。点击确定后，会发现空闲分区没有了，在这里要注意，一般情况下，这里会出现两个类型是efi的空间，有一个空间的命名是带有windows boot之类的，这个就是windows启动项，而另一个200m左右的efi类型分区就是我们刚才操作的分区，这里需要记好。 &emsp;&emsp;之后是swap分区，但其实18.04.4已经不是很需要这个分区了，当然我还是保留了，大家如果想避免麻烦可以也选上。具体操作是选择150g空间的空闲分区，再点击左下角+号，逻辑分区，空间起始位置，用于“swap”或“交换空间”，大小一般为电脑的物理内存的2倍左右，我电脑内存是16G，所以分了大概30G左右给swap，其实也不用这么严格，如果本身分区大小就不够，8个G也可以，按自己的实际情况就可以了。 &emsp;&emsp;然后是/：分区，这是Ubuntu的根目录，是用于安装系统和软件的，要注意的是几乎任何在Ubuntu上用终端下载的包和库都在这个分区里，并且Ubuntu系统也是安装在这里，所以要尽量大一些，我是取了50个G，具体是逻辑分区，空间起始位置，用于“ext4日志文件系统”，挂载点为“/”。 &emsp;&emsp;最后就是home分区，就类似于windows的其他硬盘，剩下的空间都分给它就好了，逻辑分区，空间起始位置，用于“ext4日志文件系统”，挂载点为“/home”。 接下来这一步非常的重要，我们在分区第一步把200m的空间分配为了efi类型的，所以一定要在安装引导器的设备这里，选择这个200m的分区，至于如何区别windows启动项的efi之前已经说过。大家一定要注意，这里一定要选择正确，如果你忘记了，可以点还原，那么分区将重新进行一次，但是一旦继续了，分区是不能还原的，会很麻烦。&emsp;&emsp;之后按着提示安装就可以了，如果之前有出现卡死不动，需要用到我之前说的改参数才能安装系统的情况，那么在第一次进入系统时，也就是出现ubuntu和windows，以及ubuntu高级选项这个界面时，同样的要按e键，在黑框中，与上次输入相同的位置，改为quite splash nomodeset_$vt_handoff，按f10，成功进入系统后在系统桌面右键打开终端。 &emsp;&emsp;输入以下代码，输入第一行之后系统会提醒输入开机密码，输入即可。 1sudo chmod +w /boot/grub/grub.cfg 1sudo gedit /boot/grub/grub.cfg &emsp;&emsp;然后在弹出的grub.cfg窗口中用ctrl+f搜索splash，把quiet splah之后都统一更改为： 1quiet splash $vt_handoff acpi_osi=linux nomodeset &emsp;&emsp;保存之后，切回终端并输入以下内容，就可以解决问题： 1sudo chmod -w /boot/grub/grub.cfg","link":"/2020/03/06/ubuntu/"}],"tags":[],"categories":[]}